content/posts/20231014-from-iphone-test.org
#+TITLE: Trying a Post From iOS
#+DATE: <2023-10-14>

* Can I post easily enough from my phone?
:PROPERTIES:
:CUSTOM_ID: can-i-post-easily-enough-from-my-phone
:END:
I would enjoy being able to write something small without being tethered to my desk. I'm trying a simple markdown editor from my iPhone and Working Copy. Let's see if this simple post can make it online via GitHub actions. Typing on here is of course sub-optimal but it's not so bad. The quick text corrections coupled with the cuddly dog outweigh the slow speed.

* What else
:PROPERTIES:
:CUSTOM_ID: what-else
:END:
For sure I will need to figure out a workflow for posting and uploading photos here. My most likely scenario would be posting a great photo while fishing.
