posts/20231014-from-iphone-test.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>./greg.out - Trying a Post From iOS</title>
<meta name="author" content="Greg Silverstein" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/me/css/style.css">
<link rel="alternate" type="application/rss+xml" title="./greg.out" href="/me/index.xml">
<meta name="viewport" content="width=device-width, initial-scale=1">
</head>
<body>
<div id="preamble" class="status">
<header class="site-header"><div class="wrap"><div class="brand"><a class="logo" href="/me/">./greg.out</a><div class="subtitle">Greg Silverstein's Home on the internet</div></div><nav><a href="/me/">Home</a><a href="/me/about.html">About</a><a href="/me/resume.html">Resume</a><a href="/me/index.xml">RSS</a><a href="https://github.com/gsilvers">GitHub</a></nav></div></header><div class="wrap page-head"><h1 class="page-title">Trying a Post From iOS</h1><div class="page-meta">2023-10-14</div></div>
</div>
<div id="content" class="content">
<section id="outline-container-can-i-post-easily-enough-from-my-phone" class="outline-2">
<h2 id="can-i-post-easily-enough-from-my-phone">Can I post easily enough from my phone?</h2>
<div class="outline-text-2" id="text-can-i-post-easily-enough-from-my-phone">
<p>
I would enjoy being able to write something small without being tethered to my desk. I'm trying a simple markdown editor from my iPhone and Working Copy. Let's see if this simple post can make it online via GitHub actions. Typing on here is of course sub-optimal but it's not so bad. The quick text corrections coupled with the cuddly dog outweigh the slow speed.
</p>
</div>
</section>
<section id="outline-container-what-else" class="outline-2">
<h2 id="what-else">What else</h2>
<div class="outline-text-2" id="text-what-else">
<p>
For sure I will need to figure out a workflow for posting and uploading photos here. My most likely scenario would be posting a great photo while fishing.
</p>
</div>
</section>
</div>
<div id="postamble" class="status">
<footer class="site-footer"><div class="wrap">Written by Greg Silverstein &middot; theme <a href="https://github.com/protesilaos/ef-themes">ef-cherie</a> &middot; built with org-publish in GNU Emacs</div></footer>
</div>
</body>
</html>
